OF500/setOlaFlume/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      cnoidal;

genAbs          1;

absDir          0.0;

nPaddles        1;

waveHeight      0.10;

wavePeriod      3;

waveDir         0.0;

wavePhase       1.57079633;

// Parameters for setOla
setWaterLevel   0.4; // Still water level (Z, in m)
setWaterDepth   0.4; // Water depth to use in calculations (if irregular bottom)

// Change both entries to true to re-read this dictionary upon restart.
rereadAlpha     false;
rereadU         false;

// ************************************************************************* //
